Revit 2027 API
TableSectionData.SetRowHeightInPixels Method
 This sets a row's height in logical pixels
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRowHeightInPixels(
	int nRow,
	int height
)
Public Sub SetRowHeightInPixels (
	nRow As Integer,
	height As Integer
)
public:
void SetRowHeightInPixels(
	int nRow,
	int height
)
member SetRowHeightInPixels :
        nRow : int *
        height : int -> unit
Parameters
nRow Int32
height Int32
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The row height is outside of acceptable range.
InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace